content-org/all-posts.org
#+hugo_base_dir: ../
#+macro: abbr @@html:<abbr title="$2">$1</abbr>@@
#+macro: dfn @@html:<dfn>$1</dfn>@@
#+macro: var @@html:<var>$1</var>@@
#+macro: q @@html:<q cite="$1">$2</q>@@
#+macro: person @@html:<span class="person p-name">$1</span>@@
#+macro: lang @@html:<span class="language">$1</span>@@

*** DONE Power Structure of Social Networks :fediverse:opinion:
CLOSED: [2022-11-16 00:08]
:PROPERTIES:
:EXPORT_FILE_NAME: power-structure-of-social-networks
:END:
**** Intro
Why do some nations fail and rise so quickly?
The answer to this questions has a surprisingly relevant answer to the recent migrations from a Twitter to Mastodon.

**** Power Centrality
Basically the idea is that:

1. In any system of governance the authority is constrained to the resources it has available.
2. And for the authority to make a change, it has to answer to the resource providers.
3. Given a set interdependent institutions one could form check-and-balance system.
4. If the dependence is not formed in a way that is biased towards zero-sum relationships the authority thrives.
5. For the society to thrive it should be considered an institution on it's own.

Let's make a few different forms of government considering the rule's I just discussed.

#+begin_note
As dependence on involvement of people only comes when governments want more power and cannot retain the resources necessary from the land, High Natural-Resources and High People-involvement tend to be mutually.
#+end_note

**** High Centrality, High Natural-Resources, Low People-involvement
Let's imagine a dictatorship on a land with rich natural resources. Dictatorship is an strongly centralized form of government. As such, the dictator does not have any dependencies. You might think that the government does need its people. But most of the time, such dictatorship has all that it needs from the naturally available resources.

The dictator does not have to answer to anyone, and they have all the means necessary to make rapid changes, good or bad. The whole of the nation rise and fall quickly. The civic progression does not accumulate in time and only will be there while the dictator let it to be.

The government does not need people uniting, form a danger to the government. Such authorities are highly motivated to bring social conflict, such as racism. Which may even lead to genocide by members of the society.

#+begin_example
Think of: Middle-east with it's rich natural oil.
#+end_example

**** High Centrality, Low Natural-Resources, Low People-involvement
Now, let's imagine a dictatorship on a land with no natural resources, and no inclination to involve people.

Such a nation will not flourish. The dictator is extremely constrained in its power.

It has no validity among its people. As such it is unsuccessful in enforcing any law, good or bad. Such a nation sees lots and lots of /coup d'états/. The authority is more alike a warlord.

#+begin_example
Think of: Central African nations.
#+end_example

**** High centrality, Low Natural-Resources, High People-involvement
Such a dictatorship, is a highly populist government. The dictator threats people as the main form of resource. Such nations can rise quickly. But before too long, the authority will figure out that he only needs society's approval, but not its growth. And if you need approval, there is no quicker and better way than a common enemy. As such, such nations become too hostile to other nations. And may end-up using genocide as a means of keeping the country united.

#+begin_example
Think of: Germany during the Hitler era.
#+end_example

**** Low Centrality, High Natural-Resources, Low People-involvement
Such a nation looks great from the outside, but inside? It is polarized to say the least. These nations, just like any other nation with Low-Centrality is stable. The is formed by a group of institutions which keep each other in check. But alas, what good is it, if it is not for people?

Such governments end up becoming extremely rich. But because people are not required for the government to perform, most of what the government is doing is providing value for the few that can provide them the resources they need.

Such governments nations are subject to low progression in the civic laws, are extremely hard to change, and form strong bonds with few entities. As people are seen as a barrier, government's like this tend to have a lot of controversial and theatrical surfaces, but end-up deciding things behind closed doors.

#+begin_example
Think of: USA during recent years, as it managed to put a huge people's involvement.
#+end_example

**** Low Centrality, Low Natural-Resources, Low People-involvement
These governments are stable, but irrelevant. They fail to bring order, or protection for their people. And they don't provide any infrastructural benefits the society.

#+begin_example
Think of: Afghanistan Right after USA army left it.
#+end_example

**** Low Centrality, Low Natural-Resources, High People-involvement
This, at least for now, seems to be some what the better of them all, but with some caveats. These governments are highly stable, and highly motivated by providing value to the people. They accumulate wealth and culture overtime. They are, also, resilient to hostile neighbours and bad actors. These societies tend to look good on the outside, but much better on the inside.

However, such governments are only weak to adapt to any radical changes, as the changes only happen when the people will it to happen. That means that these societies tend not to be the leaders or experimenters of different sorts of progress. However, they may end up reaching the top of the leader board in time.

#+begin_example
Think of: Germany, today.
#+end_example

**** How does it relate to the Twitter and Fediverse and ...?
Well, there is a analogy to be made here.

We can see the body(s) that runs, maintains, develop and moderate a social network as a form of a government. The users as the people and society.
And the way that the proverbial social-network governments are being funded as the determining factor of people's involvement in governance.

In that regard we can think of Twitter, Facebook as highly concentrated. Considering that their power is immensely related to the number of users they have, we may be tempted to see them as somewhat of high in involvement of people.
but in actuality, people do not need to be actually participating in governing such a system. As they are the product, and the value comes from external means. That means that the users ended up being the natural resource of the land that is being sold for resources to the external actors.

As such we end up with both exploitation of the users and their lack of ownership of their own data.

**** So, what can be the solution?
Considering how unfortunate this situation is, there has always been a few different alternatives. Let's just review them.

There are systems that don't count users as product, but as the customer. Such services, though small have a better record of listening to users.

However, as any centralized system, they are unstable, they remain small, and to keep users, they resort to vendor lock-ins. They also resort advertisement instead of increasing real value. Think of apple with its anti-advertisement campaigns against Microsoft.

Another solution might be highly centralized systems without any sort of resources. These tend to be highly volatile and fast to disappear.

So, decentralization might be the way to go.

As low-centrality but highly-resourcefulness goes, I can only think of mailing groups. Mailing groups stand on the shoulders of mail providers.

Decentralized as mailing is, the ecosystem overwhelmingly is provided by a few company that their main products are again, people.
As discussed earlier, such systems tend to not have much progress. At least, not for the non-governing bodies. And indeed, that has been true.
Mailing and mailing groups is as user friendly and featureful as they have been 15 years ago.

Which makes us resort to our last option. Low centrality and High involvement of people. Such a system has been the model for open-source development. Where the governance is highly motivated to help the people the same time as the people are highly motivated to help the governance.
Such a model has ended up being extended into forms of social governance. Where users fund their instances, help development and do volunteer moderations. And indeed, again, the parallel is not surprising: These systems tend not to have the greatest of the starts, but they end up enduring, and becoming more resilient.

Mastodon, Pixelfed and other federated, open-sourced social networks, operate in such a model. And I like to think of people moving from Twitter to Mastodon as realizing that they matter and can should be more.

**** Credit
This work is highly inspired and heavily reliant on {{{person(Daron Acemoglu)}}}'s fantastic book, /Why Nations Fail/. A must read.

